# List of Contents

### 01 Importing libraries

### 02 Checking Data Consistency (df_prods) Q1

### 03 Checking Data Consistency (df_ords) Q2-8

### 04 Exporting

# 01 Importing libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Assigning a path
path = r'/Users/dramblys/Desktop/Achievement 4/Instacart Basket Analysis'

In [3]:
df_prods=pd.read_csv(os.path.join(path, '02 Data', 'original Data', 'products.csv'),index_col=False)

In [4]:
df_ords=pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'),index_col=False)

# 02 Checking Data Consistency (df_prods) Q1

In [5]:
# check for mixed type columns in df_prods
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col)

product_name

In [6]:
# check for missing values in df_prods
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [7]:
# subset of missing
df_nan = df_prods[df_prods['product_name'].isnull()==True]

In [8]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [9]:
# find number of rows
df_prods.shape

(49693, 5)

In [10]:
# creating subset/new df without missing
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [11]:
# find number of rows (49693-16, should be 48677)
df_prods_clean.shape

(49677, 5)

In [12]:
# find duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [13]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [14]:
# drop duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [15]:
# find number of rows (-5, should be 48672)
df_prods_clean_no_dups.shape

(49672, 5)

# 03 Checking Data Consistency (df_ords) Q2-8

In [16]:
# run describe Q2
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Q2 
Looks mostly consistent. 
Order_id ranges from 1 to 3,421,083 (number of rows), mean same as 50%.
User_id starts at 1, max is less than count, mean and 50% close, but not the same, as some users order more often than others...
Order_number starts at 1, goes to 100, mean is low at 17, but since 50% is 11 and 75% is 23, most orders are low nubers, it makes sense. 
Orders_day_of_week 0 to 6 (7), 50% is 3 (mid-point 0-6), 25% is 1, 75% is 5, makes sense. 
Orders_hour_of_day 0 to 23 (24), mean and 50% is around 13 - higher than midpoint of 11.5, could be because 0-10 includes more off-peak hours than 16-23. 
Days_since_prior_order 0 to 30. 50% is 7 - ~half of the customers order at least once a week. The count is lower than that of any other column, which might indicate missing values (206,209 - same as max user_id).

In [17]:
# check for mixed type columns in df_ords Q3
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

Q4 Nothing to fix, as no mixed-data columns found.

In [18]:
# check for missing values in df_ords Q5
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

Q5 As expected from describe, there are 206,209 missing data points in days_since_prior_order column. Since max in that column is 30d, maybe the system does not track anything above that. Since min is 0, i am assuming this can't be day T+0 (today) orders?

In [19]:
# subset of missing
df_nan = df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [20]:
df_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [21]:
df_nan.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,2.062090e+05,2.062090e+05,206209.000000,206209.0,206209.000000,206209.000000,0.0
mean,1.712637e+06,1.708462e+06,103105.000000,1.0,2.754118,13.626597,NaN
std,9.874816e+05,9.881299e+05,59527.555167,0.0,2.076205,4.223769,NaN
min,0.000000e+00,2.000000e+01,1.000000,1.0,0.000000,0.000000,NaN
25%,8.579730e+05,8.507300e+05,51553.000000,1.0,1.000000,11.000000,NaN
50%,1.717068e+06,1.706246e+06,103105.000000,1.0,3.000000,14.000000,NaN
75%,2.570518e+06,2.564292e+06,154657.000000,1.0,5.000000,17.000000,NaN
max,3.421069e+06,3.421081e+06,206209.000000,1.0,6.000000,23.000000,NaN

Q6 It is the very first order for each customer, so there are no days since prior order. I think it should be left AS IS, because neither imputing not removing makes sense.

In [23]:
# find duplicates Q7
df_dups = df_ords[df_ords.duplicated()]

In [24]:
df_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

Q8 there are no duplicates.b

# 04 Exporting Q9

In [25]:
# exporting df_prods_clean_no_dups and df_ords Q9
df_ords.to_csv(os.path.join(path,'02 Data', 'Prepared Data', 'orders_checked.csv'))

In [26]:
df_prods_clean_no_dups.to_csv(os.path.join(path,'02 Data', 'Prepared Data', 'products_checked.csv'))